// pages/third/third.js
var app = getApp();
Page({

  /**
   * 页面的初始数据
   */
  data: {
    Istrue:true,
    String:"",
    inputValue:"",
    dictory: [],
    shouyu: [],
    sy: [['abcdefghijklmnopqrstuvwxyz'],
      ['人你我他人民群众公民国民市民你们我们他们自己大家谁男女婴儿儿童青年老人聋祖父家属祖母父亲母亲外公婶姑舅哥哥嫂姐弟弟妹妹哥儿子女儿丈夫孙子妻子女婿同志同事同学同胞乡亲朋友师傅先生女士华侨归侨英雄烈士烈属军属阿姨宝贝保姆标兵别人夫人公仆功臣顾客雇员老板旅客明星新郎新娘学生'], ['领队评委助理总裁领导领袖总统元首总理大使首长部长局长处长主任秘书常委代表干部队长组长会员'], ['咖啡快餐啤酒饮料汤圆食品饭粥面粉面条面包馒头饼包饺子油条蛋糕饼干牛奶淀粉汤肉蛋盐酱油醋糖香烟茶酒冰棍雪开水'], ['称呼成员地位对手居民级别客户邻居名义难民强者弱人类先锋灾民资格学生地主农皇帝皇后公主贵族状元秀才官僚军阀奴隶流氓特务敌人长城大陆故宫淮河庐山秦岭泰山天坛运河'], ['陈杜何胡江孔梁刘鲁罗毛沈苏孙王汪吴武许徐杨余于张章赵郑周朱'], ['丝丝绸尼龙衣服裤子背心手套包袱袋子行李'], ['零一二三四五六七八九十百千万亿'], ['党支部中央地方政府机关机构法院团体单位组织协会政治主权义务统治祖国国家政策决策宗旨主张阶级集体革命斗争奋斗战争和平解放口号号召局势抵制自由纪律团结保卫缓和扶植分裂孤立威胁爆发压迫阴谋伎汉族'], ['家庭生活恋爱对象结婚离婚分居睡觉起床刮理发洗澡回家烹饪抚养聊天美容家'], ['行政管理筹备准备举行开幕讨论闭幕宣誓批准反对汇报指示报告解决批判表扬批评处理调查整理选拔申请登记补助安置民政'], ['宪法民法刑法法律法令章程制度条例治安规则违法诉讼起诉交代自首服从检举审判宣判犯罪隐瞒腐蚀贿赂贪污走私勾结谣言镇压扣留监狱教养符号继承'], ['国防公安战略海防消防后勤部署指挥侦察包围抵抗射击发射爆炸胜利失败退却牺牲侵略投降消灭占领密码退伍警卫缉私拘留保安边防搏斗参谋对峙防守封锁俘虏海军缴获空军陆军瞄准收复搜查挑战突击罪犯'], ['民兵军衔元帅将军军师旅营连班士兵队伍武器装备导弹炸弹火箭大炮手枪步枪坦克雷达刺刀子弹鱼雷'], ['背包唱片床灯耳机发棍棒水麻袋丝暖气风暖瓶香水摇篮音响家具桌子椅子凳子茶几沙发床单地毯盆痰茶纸子浆毛巾镜子眼镜手表剪刀针线电灯蜡烛电池电表温度铃伞锁钥匙碗杯葫芦勺盆瓶桶秤刀铲子锅盖锅炉饼煤气木刀火火柴水绳子'], [], ['宗教信仰灵魂祈祷佛教道教回教尼姑庙地狱跪祭祀教徒洗信'], ['历史原始部落公社封建割兼并考古人坟墓'], ['哲学意识认识思维精神物质存在感想理性主观客观概念逻辑观点方式印象抽象想象全面片面规律条件原因因素范畴界限禁止飞跃分析判断综合比较矛盾对立统一绝对平均直接具体系统主动'], ['心理心情感情快乐难过满意希望失望警惕麻痹果断犹豫恨气氛爱爱情爱戴爱护爱相信迷信信任尊敬怀疑关心担心信心决心雄心志愿思想理想幻想刺激抑感觉想记忆忘记乐观悲观研究害怕反省重视'], ['年月日春夏秋冬不久除夕初期当天当时分钟公元古代后期机会假期近经过腊月每年每年每月钟年限农历初期期限迄今前期前夕日期日程上旬生日差时机适时寿命岁月随时同时提前下旬先后现在现代限期小时延期预期元旦正月整天中旬终身周年周期最近时代时期阶段年代时间季春立夏立秋立冬春分秋分星期今天明天昨天白天早上晚上上午下午中午以前以后将来临时节日春节'], ['背面边边缘侧面对面附近旁边中间周围空间方向位置东西南北上下左右前后正反表面内外'], ['经济财政贸易财务统计建设金融银行海关股票债务储蓄借利息外汇汇率兑现挂税收商业商店商品市场集市经营管理资本利润规划计划投资业务合同承包价值价格信息保险物资资源输入输出收入支出批发零售买卖便宜昂贵交售交换供应调剂转让消费积累工资损失淘汰财产成本股东还债交易金额利率流通垄断马克毛利美元名牌钱日元升值物价支票资金租'], ['工业行业机械冶金模能源压造纸纺织印染焊接企业公司工厂车间仓库生产产品成品废品潜力数量节约浪费消耗加工工艺操作设计鉴定包装故障事故检修维修修理保管遥控润滑设备工具通用专用零件仪表仪器电脑插尺角瓦刀原料金属生铁塑料涂料汽油建筑工程房子楼房电梯顶梁墙壁门窗厨房食堂宿舍厕所院子阳台地板玻璃油漆灰水泥砖瓦'], ['交通运输道路隧道里程火车汽车卡车电车桥飞机机场码头邮局邮票车票电话信'
      ], ['农田土土地耕地农场温室粪坑种植种子播种插杂交成熟收割收获粮食作物稻子花生桃枣苹果香核桃葡萄甘蔗西瓜农具玉米棉花木耳银耳青白菜姜葱大蒜笋水库垃圾鸡鸭鹅鸽蚕猪牛羊马驴渔虾草灰尘荔枝庄稼'], ['体育运动比赛裁判冠军亚军赢输田径跳高走滑冰篮球足球接力排球跨铅体操单拳击网球游戏秋千'], ['数学几何比例倍分数正指数分子方分直半圆面积体积平面平方立方开方公式直角角三角垂直对例子吨周直线弦填空线商平积等于'], ['物理原理重量能量密度膨胀水蒸发凝固沸腾倾斜撞击放反射固体液体气体电磁场声音杠杆对流'], ['化学结构火燃烧过滤氧气空气成分'], ['生物生命生长发育衰老萎缩死亡遗产滋长细胞细菌脂肪胚胎'], ['天天空宇宙星卫星太阳地球月亮气象气候晴云阴雨暴雨风风狂风雷雾霜雪冰霞虹'], ['地理地质地图陆地海洋高原山丘陵岛屿暗礁江河湖塘波浪潮瀑布北极南极赤道岸洪水滑坡坑坡珊瑚湾淹没植被'], ['狮虎熊象猴狼狗熊猫猫鼠鱼蛇蛙燕蚂蚁蝴蝶跳河马羊鹿鸟鹅松鼠牛'], ['森林竹花草叶树'], ['金银铜钢铁铝铅锡煤石油'], ['凹碧绿扁差橙色粗糙催摧毁陡峭繁杂方便防止肥沃分明腐烂光滑褐色滑稽灰混寂静吉祥柔和臊舒服爽快透明凸弯完美凶恶醒炎热颜色阴暗英俊悠久悠扬匀称崭新壮丽棕褶子特征特性特色特点长短高矮宽窄深浅涨落厚薄粗细胖瘦直曲好坏正歪方圆尖钝大小挺平皱沾干湿多少单双密疏空实紧松胀缩硬软强弱浓淡稠重稀轻生熟老嫩亮暗远近快慢升降冷热暖饱饿新旧破脏乱美丑真假红黄蓝青绿紫白黑香臭腥甜咸酸辣涩脆烂拔摆扳绊搬运绑包报答暴露逼避让猜蹭缠抄撤撑承办冲抽揣闯戳刺撮搭挡倒瞪滴钩叮顶抖逗渡端翻飞扶割灌拍骚拉提抬拿带抓折挖剔夹拧绞开关填塞插堆挂铺盖掀扔接装卷捆穿戴脱洗擦磨捞舀拌砍刮搬摇走跑跳踢坐蹲踢立骑跨踩来去进退跟到看听说吃喝咬嚼咽吸喊嗅靠趴滚转哄晃挥交替解散举举办烤啃爬跪挤笑哭吹撩醉漏用痛抱溅搓骂迈挠捏抛喷捧撇扑掐撬敲惹揉洒杀伸甩栓涮撕弹掏同意吐托望喂吻压砸摘蘸撞'],[]
    ]




  },
  onPullDownRefresh: function () {

    wx.showToast({
      title: '刷新成功！',
      icon: 'sucess',
      duration: 2000
    })
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    var that = this
    console.log(options)
    
      that.setData({
        dictory: that.data.sy[options.id]
      })
      wx.request({
        url: "https://983626636.xilihuala.xyz/index.php/danci/juzi/" + that.data.dictory,
        method: "post",
        date: {

        },
        header:
        {
          'content-type': 'application/json'
        },
        success: function (res) {
          console.log(res.data)
          that.setData({
            shouyu: res.data
          })
          // this.setData({
          //   and:res
          // })
          // wx:
          that.setData({
            Istrue: false
          })
          wx: wx.hideNavigationBarLoading()

        },
        fail: function () {
          console.log("2")



        },
        complete: function () {

        }
      })





    
  },
  clearInput: function () {
    var that = this

    that.setData({
      inputValue: "",
      Istrue: false
    })
  },
  searchInputValue1: function (e) {
    var that = this
    
    that.setData({
      inputValue: e.detail.value
    })
    if (that.data.inputValue!="")
    {
      that.setData({
        Istrue:true
      })
    }
  },
  showInput:function(){
    var that = this
      console.log(this.data.inputValue)
    that.setData({
      String: this.data.inputValue

    })


    wx.request({
      url: "https://983626636.xilihuala.xyz/index.php/danci/juzi/" + that.data.String,
      method: "post",
      date: {

      },
      header:
      {
        'content-type': 'application/json'
      },
      success: function (res) {
        console.log(res.data)
        that.setData({
          shouyu: res.data
        })

        that.setData({
          Istrue: false
        })
        // this.setData({
        //   and:res
        // })
        wx: wx.hideNavigationBarLoading()

      },
      fail: function () {
        console.log("2")



      },
      complete: function () {

      }
    })


    wx: wx.showNavigationBarLoading()



  },

  onReachBottom() {
  },








   

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },
  detail3: function (event) {
    console.log(event)
    var add = JSON.stringify(event.currentTarget.dataset.myUser);
    console
    wx.navigateTo({
      url: '/pages/detail3/detail3?id=' + add,
    })
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
    

    

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

    return {
      title: "向你介绍手语--"
    }

  }

})